# frozen_string_literal: true

tap 'neovim/neovim'
tap 'yt-dlp/taps'
tap 'koekeishiya/formulae'
tap 'itchyny/tap'

brew 'mise'
brew 'curl'
brew 'bash'
brew 'neovim', args: ['HEAD']
brew 'starship'
brew 'moreutils'
brew 'fzy'
brew 'atool'
brew 'exiftool'
brew 'coreutils'
brew 'itchyny/tap/mmv'
brew 'ffmpeg'
brew 'fd'
brew 'ripgrep'
brew 'grep'
brew 'tmux'
brew 'git'
brew 'btop'
brew 'tree'
brew 'wget'
brew 'bash-completion@2'
brew 'gcc'
brew 'imagemagick'
brew 'jq'
brew 'ctags'
brew 'gawk'
brew 'graphviz'
brew 'pandoc'
brew 'pgcli'
brew 'fzf'
brew 'watch'
brew 'llvm'
brew 'bat'
brew 'lazygit'
brew 'lazydocker'
brew 'yt-dlp'
brew 'gh'
brew 'viddy'
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'
brew 'stylua'
brew 'git-delta'
brew 'go'
brew 'mkcert'
brew 'awscli'
brew 'libpq'
brew 'direnv'
brew 'duf'
brew 'gdu'
brew 'ast-grep'
brew 'pngpaste'
brew 'uv'
brew 'glow'
brew 'displayplacer'
brew 'llm'
brew 'bandwhich'
brew 'lua-language-server'
brew 'switchaudio-osx'
brew 'default-anton/tap/wt'
brew 'tw93/tap/mole'
brew 'steipete/tap/gifgrep'
brew 'lightonai/colgrep/colgrep'

cask 'font-fira-code-nerd-font'
cask 'ghostty'
