# frozen_string_literal: true

tap 'neovim/neovim'
tap 'goreleaser/tap'
tap 'yt-dlp/taps'
tap 'jesseduffield/lazygit'
tap 'homebrew/cask-fonts'
tap 'koekeishiya/formulae'
tap 'itchyny/tap'

brew 'curl'
brew 'bash'
brew 'neovim', args: ['HEAD']
brew 'starship'
brew 'moreutils'
brew 'fzy'
brew 'atool'
brew 'exiftool'
brew 'coreutils'
brew 'itchyny/tap/mmv'
brew 'ffmpeg'
brew 'fd'
brew 'ripgrep'
brew 'grep'
brew 'tmux'
brew 'git'
brew 'git-standup'
brew 'htop'
brew 'tree'
brew 'wget'
brew 'bash-completion@2'
brew 'bundler-completion'
brew 'docker-completion'
brew 'docker-compose'
brew 'gem-completion'
brew 'rails-completion'
brew 'rake-completion'
brew 'ruby-completion'
brew 'gcc'
brew 'imagemagick'
brew 'jq'
brew 'ctags'
brew 'colordiff'
brew 'gawk'
brew 'graphviz'
brew 'pandoc'
brew 'pgcli'
brew 'nvm'
brew 'fzf'
brew 'watch'
brew 'llvm'
brew 'bat'
brew 'jesseduffield/lazygit/lazygit'
brew 'jesseduffield/lazydocker/lazydocker'
brew 'yt-dlp/taps/yt-dlp'
brew 'goreleaser/tap/goreleaser'
brew 'gh'
brew 'pdm'
brew 'protobuf'
brew 'shellcheck'
brew 'shfmt'
brew 'viddy'
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'
brew 'stylua'
brew 'git-delta'
brew 'go'
brew 'rbenv'
brew 'ruby-build'
brew 'nss'
brew 'mkcert'
brew 'awscli'
brew 'libpq'
brew 'direnv'
brew 'golangci-lint'
brew 'duf'
brew 'bandwhich'
brew 'lua-language-server'
brew 'gdu'
brew 'ast-grep'
brew 'pngpaste'
brew 'uv'

cask 'lulu'
cask 'alacritty'
cask 'blackhole-16ch'
cask 'font-fira-code-nerd-font'
cask 'slack'
cask 'telegram'
cask 'vlc'
cask 'visual-studio-code'
cask 'google-chrome'
cask '1password'
cask 'zoom'
cask 'notion'
cask 'keycastr'
cask 'orbstack'
